## **D129:税率の変更**

#あなたは商品の価格にかかる税金の額を計算するプログラムを書いていましたがある時期から税率が上がることになりました。

#商品の価格、元の税率(％)、新しい税率(％)がスペース区切りで与えられるので税率が変化することで税込価格が何円変わるのか計算するプログラム作ってください。

#条件すべてのテストケースにおいて、以下の条件をみたします。
#• ・100 ≦ p ≦ 2000
#• ・p は 100 の倍数
#• ・1 ≦ x ≦ 100
#• ・1 ≦ y ≦ 100
#• ・x < y

p, x, y = gets.chomp.split.map(&:to_f)

if 100 <= p && p <= 2000 && p % 100 == 0 && 1 <= x && x <= 100 && 1 <= y && y <= 100 && x < y
original_total = (p * (1 + x/100)).round(2)
new_total = (p * (1 + y/100)).round(2)

diff = new_total - original_total
puts diff.to_i
else
puts "no"
end